analyze -format verilog ../../vsrc/state_machine.v
elaborate state_machine

#read_verilog ../rtl/idct/idct_chip.v
